Autodesk.Revit.DB.BRepBuilderEdgeGeometry.Create(Autodesk.Revit.DB.Curve)
Construct BRepBuilderEdgeGeometry based on any Revit Curve, including Line and Arc.
The curve will be simplified if possible.
curve:
The 3D curve for this edge. This BRepBuilderEdgeGeometry stores a copy of the input curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
-or-
The curve is degenerate (its length is too close to zero).
-or-
The endpoints of the curve are close enough that Revit considers it a closed curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016